## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
aws_sns_topic.notifications: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic]
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.processed_data: Refreshing state... [id=processed-data]
aws_iam_role.lambda_role: Refreshing state... [id=lambda_processor_role]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=serverless-arch-lambda-bucket]
aws_s3_bucket.data_bucket: Refreshing state... [id=serverless-arch-data-bucket]
aws_sqs_queue.processing_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]
data.aws_caller_identity.current: Read complete after 0s [id=886360753244]
aws_sqs_queue_policy.queue_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]
aws_sns_topic_subscription.sns_to_sqs_sub: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic:3b34f14f-00a8-4c8f-8814-9ed86444c61b]
aws_iam_policy.processor_policy: Refreshing state... [id=arn:aws:iam::886360753244:policy/ProcessorPolicy]
aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=lambda_processor_role/arn:aws:iam::886360753244:policy/ProcessorPolicy]
aws_iam_policy.uploader_policy: Refreshing state... [id=arn:aws:iam::886360753244:policy/UploaderPolicy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.sqs_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "sqs_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:886360753244:data-processed-queue",
            ]
          + sid       = "Allow-SNS-SendMessage"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:886360753244:data-processed-topic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_lambda_function.processor will be created
  + resource "aws_lambda_function" "processor" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "process-uploaded-file"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::886360753244:role/lambda_processor_role"
      + runtime                        = "python3.11"
      + s3_bucket                      = "serverless-arch-lambda-bucket"
      + s3_key                         = "lambda/function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_s3 will be created
  + resource "aws_lambda_permission" "allow_s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "process-uploaded-file"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = "arn:aws:s3:::serverless-arch-data-bucket"
      + statement_id        = "AllowExecutionFromS3"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = "serverless-arch-data-bucket"
      + eventbridge = false
      + id          = (known after apply)
      + region      = "us-east-1"

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # aws_sqs_queue.processing_queue will be updated in-place
  ~ resource "aws_sqs_queue" "processing_queue" {
      ~ delay_seconds                     = 0 -> 60
        id                                = "https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue"
      ~ message_retention_seconds         = 345600 -> 86400
        name                              = "data-processed-queue"
      ~ receive_wait_time_seconds         = 0 -> 10
      + redrive_policy                    = (known after apply)
        tags                              = {}
        # (16 unchanged attributes hidden)
    }

  # aws_sqs_queue.unprocessed_data_queue_deadletter will be created
  + resource "aws_sqs_queue" "unprocessed_data_queue_deadletter" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "unprocessed-data-deadletter-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "us-east-1"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.queue_policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "queue_policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:us-east-1:886360753244:data-processed-topic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:886360753244:data-processed-queue"
                      - Sid       = "Allow-SNS-SendMessage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue_redrive_allow_policy.unprocessed_data_redrive_allow_policy will be created
  + resource "aws_sqs_queue_redrive_allow_policy" "unprocessed_data_redrive_allow_policy" {
      + id                   = (known after apply)
      + queue_url            = (known after apply)
      + redrive_allow_policy = jsonencode(
            {
              + redrivePermission = "byQueue"
              + sourceQueueArns   = [
                  + "arn:aws:sqs:us-east-1:886360753244:data-processed-queue",
                ]
            }
        )
      + region               = "us-east-1"
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>